## Pandas + Pyhton Exams

In [105]:
# Échanger la valeur de deux variables
def permut (x,y) : 
    tmp = x
    x=y
    y=tmp
    del tmp 
    return x,y

In [106]:
def carre(x) :
    print("Le carré de {} est : {}".format(x,x*x))
    return x*x

In [107]:
def cond() : 
    tmp = input("Saisissez un nombre  ")
    tmp = int(tmp)
    if tmp > 0:
        print("{} est positif".format(tmp))
    elif tmp < 0 :
        print("{} est négatif".format(tmp))
    else : 
        print ("{} est une valeur null non signée".format(tmp))

In [2]:
def prod () :
    x = input("Saisissez un premier nombre  ")
    y = input("Saisissez un deuxième nombre  ")
    x=int(x)
    y=int(y)
    if x == 0 or y == 0 :
        print ("Le produit de {} et {} est une valeur null non signée".format(x,y))
    elif x>0 and y>0 :
        print ("Le produit de {} et {} est une valeur positive".format(x,y))
    else :
        print ("Le produit de {} et {} est une valeur négative".format(x,y))

In [109]:
def calcul(x):
    print("La suite des dix nombres suivants {}\n".format(x))
    for i in range(10):
        x+=1
        print(x)

In [110]:
def add(x):
    for i in range(1,x):
        x=x+i
    return x

###  Pandas

In [111]:
import pandas as pd
import numpy as np

In [112]:
df =  pd.read_csv("/home/lenovo/Téléchargements/Pandas_exercice.csv",delimiter=',')
df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  05-10-2012         3001         5002
1    70009     270.65  09-10-2012         3001         5005
2    70002      65.26  05-10-2012         3005         5001
3    70004     110.50  06-10-2012         3001         5003
4    70007     948.50  10-09-2012         3005         5002
5    70005    2400.60  10-09-2012         3001         5001
6    70008    5760.00  10-09-2012         3005         5001
7    70010    1983.43  10-10-2012         3001         5006
8    70003    2480.40  10-10-2012         3005         5003
9    70012     250.45  17-06-2012         3001         5002
10   70011      75.29  07-08-2012         3005         5007
11   70013    3045.60  08-08-2012         3005         5001

In [113]:
def max(df):
    #Afficher le max de toutes les colonnes 
    return df.describe().loc['max']

In [114]:
max(df)

ord_no         70013.0
purch_amt       5760.0
customer_id     3005.0
salesman_id     5007.0
Name: max, dtype: float64

In [129]:
def sum(df,column,column_tri):
    return df.groupby([column_tri])[column].sum()

In [128]:
sum(df,'purch_amt','customer_id')

customer_id
3001     5166.13
3005    12375.05
Name: purch_amt, dtype: float64

In [117]:
def tri(df,column):

   return df.sort_values(by = [column],ascending = False)

In [118]:
df_tri = tri(df,'purch_amt')

In [119]:
df_tri

    ord_no  purch_amt    ord_date  customer_id  salesman_id
6    70008    5760.00  10-09-2012         3005         5001
11   70013    3045.60  08-08-2012         3005         5001
8    70003    2480.40  10-10-2012         3005         5003
5    70005    2400.60  10-09-2012         3001         5001
7    70010    1983.43  10-10-2012         3001         5006
4    70007     948.50  10-09-2012         3005         5002
1    70009     270.65  09-10-2012         3001         5005
9    70012     250.45  17-06-2012         3001         5002
0    70001     150.50  05-10-2012         3001         5002
3    70004     110.50  06-10-2012         3001         5003
10   70011      75.29  07-08-2012         3005         5007
2    70002      65.26  05-10-2012         3005         5001

In [120]:
df_tri['purch_amt'].loc[(df_tri['purch_amt'] < 301)] = np.nan

/home/lenovo/snap/jupyter/common/lib/python3.7/site-packages/pandas/core/indexing.py:1636: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [121]:
df_tri

    ord_no  purch_amt    ord_date  customer_id  salesman_id
6    70008    5760.00  10-09-2012         3005         5001
11   70013    3045.60  08-08-2012         3005         5001
8    70003    2480.40  10-10-2012         3005         5003
5    70005    2400.60  10-09-2012         3001         5001
7    70010    1983.43  10-10-2012         3001         5006
4    70007     948.50  10-09-2012         3005         5002
1    70009        NaN  09-10-2012         3001         5005
9    70012        NaN  17-06-2012         3001         5002
0    70001        NaN  05-10-2012         3001         5002
3    70004        NaN  06-10-2012         3001         5003
10   70011        NaN  07-08-2012         3005         5007
2    70002        NaN  05-10-2012         3005         5001

In [135]:
permut (3,4)

(4, 3)